{
    "home": {
        "my-name-is": "Здравей! Аз съм",
        "radoslav-mandev": "Радослав Мъндев",
        "build-and-research": "Създавам и проучвам неща",
        "rotator": {
            "for-the-web": "за уеб",
            "for-pq-crypto": "за след-квантова криптография",
            "java": "с Java",
            "ble": "за уязвимости в BLE",
            "js": "с JavaScript"
        },
        "I-am": "Студент, изучаващ",
        "cs-stud": "компютърни науки",
        "spec": ", който специализира в",
        "web-dev": "уеб програмиране",
        "and": "и",
        "cybersec": "киберсигурност",
        "get-in-touch": "Пиши ми",
        "right-nav": {
            "about": "За мен",
            "experience": "Опит",
            "projects": "Проекти",
            "contact": "Контакт"
        }
    },
    "main": {
        "built-by-me": "Създаден от мен"
    },
    "about": {
        "about-me": "За мен",
        "me": {
            "my-name-is": "Казвам се ",
            "radoslav-mandev": "Радослав Мъндев",
            "born-in": ", и съм роден през 1999 в България."
        },
        "study": {
            "degree": "В момента уча специалността ",
            "cs": "компютърни науки",
            "at": " в ",
            "uni": "универистет Пасау",
            "de": ", Германия"
        },
        "field": {
            "passion": "От както бях на 13 се впечатлих дълбоко във всичко свързано с ",
            "tech": "технологии",
            "web": "уеб",
            "and": " и ",
            "cybersecurity": "киберсигурност",
            "programming": "програмиране"
        },
        "hobbies": {
            "enjoy": "В свободното си време обичам да ",
            "reading": "чета",
            "doing": ", ",
            "photo": "снимам",
            "espresso": ", да търся геокешове, да пия и правя ''специално'' кафе, ",
            "biking": "планинското колоездене",
            "orienteering": " или ориентиране"
        }
    },
    "exp": {
        "done": "С какво съм се занимавал",
        "uni": {
          "time": "Септ 2018 - Сега",
          "name": "Университет Passau",
          "position": "Бакалавър по Компютърните Науки",
          "desc": {
            "s1": "Близо съм до завършването на бакалавърската си степен в областта Компютърни науки, водена изцяло на немски. По време на обучението си в този университет, фокусиран върху научните изследвания, научих множество ценни умения.",
            "s2": "В задължителните курсове научих всичко за анализи, линейна алгебра, стохастика, информатика (теоретична и практическа), компютърна архитектура, мрежи, разпределени системи, бази данни, IT-сигурност и много други. Знанията, които получих в тези лекции, бяха безценни и изградиха основата на моето разбиране за областта на информатиката.",
            "s3": "Друга ключова част от моето обучение беше стажът, който направих за университета. Това включваше голям проект, който екипът ни трябваше да завърши в продължение на цял семестър. Голям акцент беше поставен върху сигурността, за която отговарях аз. Правенето на стаж в университета, а не в компания, беше от голяма полза за мен. Помощ, под формата на лични наставления и поправяне на грешки, получих от моя ментор.",
            "s4": "Последната част от обучението ми се състои от бакалавърска и семинарна тези. Темата на дипломната ми работа се отнася за модули за т.н ''дигитален подпис'', базирани на след-квантова криптография, за мобилни приложения с отворен код."
          },
          "sk": {
            "java": {
              "ico": "fab fa-java",
              "desc": "Java, и всичко с нея, включително голяма част JSF, паралелно програмиране и много други области."
            },
            "spring": {
              "ico": "fab fa-envira",
              "desc": "Spring Boot използвах в лекцията по инженерство на уеб и данни (Web and data engineering)."
            },
            "git": {
              "ico": "fab fa-git",
              "desc": "За система за контрол на версиите съм използвал git, в съвместност лична GitLab имплементация на университета."
            },
            "haskell": {
              "ico": "mdi-language-haskell",
              "desc": "Учих и използвах езика Haskell в лекциите по теоретична информатика."
            },
            "c": {
              "ico": "mdi-language-c",
              "desc": "Учих и използвах езика C в лекциите по теоретична информатика."
            },
            "r": {
              "ico": "mdi-language-r",
              "desc": "Учих и използвах езика R в избирателна лекция."
            },
            "db": {
              "ico": "mdi-database-search",
              "desc": "Учих и използвах PostgreSQL в множество лекции за бази данни."
            },
            "net": {
              "ico": "mdi-access-point-network",
              "desc": "Учих относно компютърни мрежи в лекции относно тях."
            },
            "lat": {
              "ico": "mdi-format-text",
              "desc": "Всички проучвания, документации и домашни писах на LaTeX."
            },
            "sec": {
              "ico": "mdi-security",
              "desc": "Научих много, относно IT-сигурност, през лекции, бакалавърската си теза и семинар."
            }
          }
        },
        "free": {
          "time": "throughout 2018",
          "name": "Freelancer",
          "desc": {
            "s1": "Преди да започна бакалавъра си в Германия работих като фрийлансър за да науча повече неща, относно програмирането. Изработвах основно портфолио уебсайтове за клиентите си."
          },
          "sk": {
            "github": {
              "ico": "fab fa-github",
              "desc": "Използвах GitHub за контрол на версиите."
            },
            "boot": {
              "ico": "mdi-bootstrap",
              "desc": "Използвах Bootstrap за да направя всичко да изглежда по-красиво."
            },
            "word": {
              "ico": "mdi-wordpress",
              "desc": "Използвах Wordpress за уебсайта на клуба по ориентиране, в който членувах."
            },
            "html": {
              "ico": "mdi-language-html5",
              "desc": "Използвах HTML5 за front-end."
            },
            "css": {
              "ico": "mdi-language-css3",
              "desc": "Използвах CSS3 за front-end."
            },
            "js": {
              "ico": "mdi-language-javascript",
              "desc": "Използвах javascript за front-end."
            },
            "vsc": {
              "ico": "mdi-microsoft-visual-studio-code",
              "desc": "VSCode беше IDE-то което избирах за повечето си проекти."
            }
          }
        },
        "softuni": {
          "time": "Окт 2015 - Авг 2018",
          "name": "Software University",
          "position": "C# Web Developer",
          "desc": {
            "s1": "В продължение на 3 години учих в българската академия за софтуерни разработчици ''СофтУни''.  Професионалното ми направиление беше C# Web Developer и включваше курсове като  C# Advanced, MVC, ASP.NET и още много други относно бази данни, работа в екип, entity framework и т.н. Участвах също в много допълнителни курсове извън програмата ми, като Arduino, JS Applications, мултимедия и офис приложения и др.",
            "s2": "''SoftUni'' е основна част от това, което съм сега, тaka като това е мястото, където започнах сериозно да се занимавам с програмиране."
          },
          "sk": {
            "ch": {
              "ico": "mdi-language-csharp",
              "desc": "Взех общо 6 курса, базиращи се на C#, така като това ми беше специалността."
            },
            "js": {
              "ico": "mdi-language-javascript",
              "desc": "Записах избираеми курсове за JavaScript за front-end, back-end, applications и advanced."
            },
            "java": {
              "ico": "fab fa-java",
              "desc": "Записах и два допълнителни курса за Java."
            },
            "vs": {
              "ico": "mdi-microsoft-visual-studio",
              "desc": "Най-използваното от мен IDE там, беше Visual Studio."
            }
          }
        },
        "green": {
          "time": "Окт 2016",
          "name": "Greenpeace (доброволство)",
          "position": "IoT Инженер",
          "desc": {
            "s1": "Доброволствах в проект, организиран от Грийнпийс, който целеше да оцени чистотата на въздуха в големите градове на България."
          },
          "sk": {
            "chip": {
              "ico": "mdi-chip",
              "desc": "Основната част на устройството, се състоеше от ATmega328P."
            },
            "web": {
              "ico": "mdi-web",
              "desc": "За уеб-интерфейса използвахме - HTML, CSS, JS и PHP."
            }
          }
        },
        "tom": {
          "time": "Мар 2016, Окт 2017",
          "name": "Tikkum Olam Makers (доброволство)",
          "position": "Софтуерен Инженер",
          "desc": {
            "s1": "Доброволствах два пъти в двете издания на TOM България. Целта на движението TOM е да свързва иноватори с хора с увреждания, за да разработят и разпространяват решения с отворен код за пренебрегвани предизвикателства. Заедно с екип проектирахме и разработихме хардуерни и софтуерни решения за хора в нужда."
          },
          "sk": {
            "chip": {
              "ico": "mdi-chip",
              "desc": "В първия проект използвахме Arduino за да контролираме мотори, соленоиди и разчитаме показанията на сензори."
            },
            "andr": {
              "ico": "mdi-android",
              "desc": "Вторият проект се състоеше в основната си част от приложение за Android."
            },
            "java": {
              "ico": "fab fa-java",
              "desc": "Основният език за програмиране, беше Java."
            },
            "db": {
              "ico": "mdi-database",
              "desc": "Използвахме онлайн база данни за интерпретиране на баркодовете."
            },
            "github": {
              "ico": "fab fa-github",
              "desc": "Използвахме GitHub за контрол на версиите."
            }
          }
        },
        "pmg": {
          "time": "Септ 2006 - Май 2018",
          "name": "Природо-математическа Гимназия ''Добри Чинтулов''",
          "position": "Ученик",
          "desc": {
            "s1": "Гимназията, която завърших, се смяташе за най-доброто образование в моя град. Специалността ми беше ''Математика, информатика и английски език''.",
            "s2": "По време на ученето си там участвах активно в състезания за БАН, СМБ и много други. Два от моите проекти спечелиха награда за перфектно представяне, а един спечели два пъти специална награда за значителен социален принос. Освен това участвах в множество математически състезания и спечелих над 14 от тях."
          },
          "sk": {
            "github": {
              "ico": "fab fa-github",
              "desc": "Използвах GitHub за контрол на версиите на проектите си."
            },
            "embed": {
              "ico": "mdi-chip",
              "desc": "Правих много от проектите си, използвайки вградени системи като Arduino, Raspberry Pi, TI Launchpad и други."
            },
            "web": {
              "ico": "mdi-web",
              "desc": "Тук и започнах да уча фундаменталните части на уеб - HTML, CSS и JS."
            }
          }
        }
      },
      "proj": {
        "title": "Projects, Tools and Skills I have used",
        "proj": {
          "used": "Used tools: ",
          "pear": {
            "title": "Pear Review",
            "assoc": "Accosiated with University Passau",
            "desc": "Pear Review is the biggest project I have participated in. I had to develop a Java Web Application as a system for peer review of scientific articles alongside four more people. The project was part of the mandatory internship for my degree. It ended up with more than 22,000 rows of code and more than 250 pages of documentation, planning and validation.",
            "tools": "Jakarta Server Faces, Primefaces, Omnifaces, PostgreSQL, JUnit, Selenium, LaTeX."
          },
          "gimms": {
            "title": "GiiMMS",
            "assoc": "Accosiated with University Passau",
            "desc": "A full stack employee management system for the course Web and Data Engineering.",
            "tools": "Spring Boot, Thymeleaf, JPA, IntelliJ IDEA."
          },
          "kittn": {
            "title": "Kittn me",
            "assoc": "Personal project",
            "desc": "A full stack cat-themed social media that I did just for fun and to learn new skills.",
            "tools": "React, Redux, Firebase, Busboy, Dicer, Streamsearch."
          },
          "abalone": {
            "title": "AI Abalone",
            "assoc": "Accosiated with University Passau",
            "desc": "A Java only project for the advanced course in programming. It consists of the game Abalone with GUI, so that it is possible to play against the computer in different levels of difficulty. The project is done only with math and the min-max algorithm.",
            "tools": "Java, Swing, JUnit."
          },
          "homie": {
            "title": "Homie Home Automation",
            "assoc": "Personal project",
            "desc": "A smart home system which one other person and I created for IT competitions.",
            "tools": "Python, PHP, Arduino, Raspberry Pi, TI Launchpad."
          }
        },
        "skil": {
          "front-end": {
            "js": "Certificate from SoftUni.",
            "vue": "Project, that uses Vue.js.",
            "react": "Project, that uses React."
          },
          "private": "Private Repository, because of University policy. Please contact me for more info.",
          "server": {
            "thy": "Project, that uses Thymeleaf."
          },
          "back-end": {
            "redux": "Project, that uses Redux for back-end.",
            "spring": "Project, that uses Spring Boot for back-end.",
            "js": "Certificate for JavaScript applications by SoftUni."
          },
          "gen": {
            "java": "Voluteer work for TOM Bulgaria.",
            "ch": "A project I did for IT competitions in Bulgaria.",
            "has": "Course from University."
          },
          "db": {
            "mssql": "A course from SoftUni.",
            "firebase": "Project, that uses Firebase for a database.",
            "jpa": "Project, that uses JPA as storage."
          },
          "tools": {
            "git": "I'm using git for all of my projects.",
            "latex": "I'm using LaTeX for math and scientific articles. Also I have a certificate from a voluntary course from my University on this subject.",
            "r": "Voluntary course from University with certificate.",
            "dig-mar": "Certificate from Google.",
            "agile": "Certificate from University.",
            "mario": "Project, that we did in Robotics sommer camp. I have multiple projects with Arduino and Raspberry pi and a certificate from SoftUni."
          }
        }
      },
      "cont":{
        "title":"Contact",
        "text":{
          "I-am":"I am currently looking for ",
          "freelance":"freelance",
          "work":" work, and/or interesting ",
          "job":"job opportunities",
          "email":", so be sure to send me an email."
        },
        "get-in-touch":"Get in touch",
        "coffee":"Buy me a coffee"
      }
    }