{
    "home": {
        "my-name-is": "Здравей! Аз съм",
        "radoslav-mandev": "Радослав Мъндев",
        "build-and-research": "Създавам и проучвам неща",
        "rotator": {
            "for-the-web": "за уеб",
            "for-pq-crypto": "за квантова криптография",
            "java": "с Java",
            "ble": "за уязвимости в BLE",
            "js": "с JavaScript"
        },
        "I-am": "Студент, който учи",
        "cs-stud": "информатика",
        "spec": "и специализира в",
        "web-dev": "уеб програмиране",
        "and": "и",
        "cybersec": "киберсигурност",
        "get-in-touch": "свържи се с мен",
        "right-nav": {
            "about": "За мен",
            "experience": "Опит",
            "projects": "Проекти",
            "contact": "Контакт"
        }
    },
    "main": {
        "built-by-me": "Създаден от мен"
    },
    "about": {
        "about-me": "За мен",
        "me": {
            "my-name-is": "Казвам се ",
            "radoslav-mandev": "Радослав Мъндев",
            "born-in": " и съм роден през 1999г. в България."
        },
        "study": {
            "degree": "В момента изучавам специалността ",
            "cs": "информатика",
            "at": " в ",
            "uni": "университет Пасау",
            "de": ", Германия"
        },
        "field": {
            "passion": "Когато бях на 13 се впечатлих дълбоко от всичко свързано с ",
            "tech": "технологии",
            "web": "уеб",
            "and": " и ",
            "cybersecurity": "киберсигурност",
            "programming": "програмиране"
        },
        "hobbies": {
            "enjoy": "В свободното си време обичам да се занимавам с ",
            "reading": "четене",
            "doing": ",  ",
            "photo": "снимане",
            "espresso": ", търсене на геокешове, правене на качествено кафе (specialty coffee), ",
            "biking": "планинско колоездене",
            "orienteering": " или ориентиране"
        }
    },
    "exp": {
        "done": "Опит",
        "uni": {
          "time": "Септември 2018 - Сега",
          "name": "Университет Пасау",
          "position": "Бакалавър информатика",
          "desc": {
            "s1": "Близо съм до завършването на бакалавърската си степен в областта компютърни науки, водена изцяло на немски език. По време на обучението си в този университет, фокусиран върху научните изследвания, придобих множество ценни умения.",
            "s2": "В задължителните курсове научих всичко за математически анализи, линейна алгебра, стохастика, информатика (теоретична и практическа), компютърна архитектура, мрежи, разпределени системи, бази данни, IT-сигурност и много други. Знанията, които получих по време на тези лекции, бяха безценни и изградиха основата на моето разбиране в областта на информатиката.",
            "s3": "Друга ключова част от моето обучение беше стажът, който направих в университета. Той включваше голям проект, който екипът ни трябваше да завърши в продължение на цял семестър. Голям акцент беше поставен върху сигурността, за която бях отговорен аз. Стажуването в университета, а не във фирма, беше от голяма полза за мен. От моя ментор получих помощ под формата на лични наставления и поправяне на грешки.",
            "s4": "Последната част от обучението ми включва бакалавърска и семинарна теза. Темата на дипломната ми работа е свързана с модули за мобилни приложения с отворен код. Те имплементират т.н. ''дигитален подпис'' и са базирани на след-квантова криптография."
          },
          "sk": {
            "java": {
              "ico": "fab fa-java",
              "desc": "Java, и всичко с нея, включително голяма част JSF, паралелно програмиране и много други области."
            },
            "spring": {
              "ico": "fab fa-envira",
              "desc": "Spring Boot използвах в лекцията по инженерство на уеб и данни (Web and data engineering)."
            },
            "git": {
              "ico": "fab fa-git",
              "desc": "За система за контрол на версиите съм използвал git, в съвместност лична GitLab имплементация на университета."
            },
            "haskell": {
              "ico": "mdi-language-haskell",
              "desc": "Учих и използвах езика Haskell в лекциите по теоретична информатика."
            },
            "c": {
              "ico": "mdi-language-c",
              "desc": "Учих и използвах езика C в лекциите по теоретична информатика."
            },
            "r": {
              "ico": "mdi-language-r",
              "desc": "Учих и използвах езика R в избирателна лекция."
            },
            "db": {
              "ico": "mdi-database-search",
              "desc": "Учих и използвах PostgreSQL в множество лекции за бази данни."
            },
            "net": {
              "ico": "mdi-access-point-network",
              "desc": "Учих относно компютърни мрежи в лекции относно тях."
            },
            "lat": {
              "ico": "mdi-format-text",
              "desc": "Всички проучвания, документации и домашни писах на LaTeX."
            },
            "sec": {
              "ico": "mdi-security",
              "desc": "Научих много, относно IT-сигурност, през лекции, бакалавърската си теза и семинар."
            }
          }
        },
        "free": {
          "time": "през 2018",
          "name": "Фрийлансър",
          "desc": {
            "s1": "Преди да започна бакалавъра си в Германия работих като фрийлансър, за да науча повече неща относно програмирането. Изработвах основно портфолио уебсайтове за клиентите си."
          },
          "sk": {
            "github": {
              "ico": "fab fa-github",
              "desc": "Използвах GitHub за контрол на версиите."
            },
            "boot": {
              "ico": "mdi-bootstrap",
              "desc": "Използвах Bootstrap за да направя всичко да изглежда по-красиво."
            },
            "word": {
              "ico": "mdi-wordpress",
              "desc": "Използвах Wordpress за уебсайта на клуба по ориентиране, в който членувах."
            },
            "html": {
              "ico": "mdi-language-html5",
              "desc": "Използвах HTML5 за front-end."
            },
            "css": {
              "ico": "mdi-language-css3",
              "desc": "Използвах CSS3 за front-end."
            },
            "js": {
              "ico": "mdi-language-javascript",
              "desc": "Използвах javascript за front-end."
            },
            "vsc": {
              "ico": "mdi-microsoft-visual-studio-code",
              "desc": "VSCode беше IDE-то което избирах за повечето си проекти."
            }
          }
        },
        "softuni": {
          "time": "Октомври 2015 - Август 2018",
          "name": "Софтуерен Университет ''СофтУни''",
          "position": "C# Web Developer",
          "desc": {
            "s1": "В продължение на 3 години учих в българската академия за софтуерни разработчици ''СофтУни''.  Професионалното ми направиление беше C# Web Developer и включваше курсове като  C# Advanced, MVC, ASP.NET, както и такива, свързани с бази данни, работа в екип и entity framework. Участвах също и в много допълнителни курсове извън програмата като Arduino, JS Applications, мултимедия и офис приложения.",
            "s2": "''СофтУни'' до голяма степен допринесе за развитието ми, защото това е мястото, където започнах сериозно да се занимавам с програмиране."
          },
          "sk": {
            "ch": {
              "ico": "mdi-language-csharp",
              "desc": "Взех общо 6 курса, базиращи се на C#, така като това ми беше специалността."
            },
            "js": {
              "ico": "mdi-language-javascript",
              "desc": "Записах избираеми курсове за JavaScript за front-end, back-end, applications и advanced."
            },
            "java": {
              "ico": "fab fa-java",
              "desc": "Записах и два допълнителни курса за Java."
            },
            "vs": {
              "ico": "mdi-microsoft-visual-studio",
              "desc": "Най-използваното от мен IDE там, беше Visual Studio."
            }
          }
        },
        "green": {
          "time": "Октомври 2016",
          "name": "Greenpeace (доброволчество)",
          "position": "IoT Инженер",
          "desc": {
            "s1": "Бях доброволец в проект, организиран от ''Greenpeace'', който целеше да оцени чистотата на въздуха в големите градове в България."
          },
          "sk": {
            "chip": {
              "ico": "mdi-chip",
              "desc": "Основната част на устройството се състоеше от ATmega328P."
            },
            "web": {
              "ico": "mdi-web",
              "desc": "За уеб-интерфейса използвахме - HTML, CSS, JS и PHP."
            }
          }
        },
        "tom": {
          "time": "Март 2016, Октомври 2017",
          "name": "Tikkum Olam Makers (доброволчество)",
          "position": "Софтуерен Инженер",
          "desc": {
            "s1": "Бях доброволец в двете издания на TOM България. TOM е популярно международно движение, което използва постиженията на съвременния дизайн и технология в помощ на хора със специални нужди. Моите задачи бяха свързани с проектиране и разработване на хардуерни и софтуерни решения."
          },
          "sk": {
            "chip": {
              "ico": "mdi-chip",
              "desc": "В първия проект използвахме Arduino за да контролираме мотори, соленоиди и разчитаме показанията на сензори."
            },
            "andr": {
              "ico": "mdi-android",
              "desc": "Вторият проект се състоеше в основната си част от приложение за Android."
            },
            "java": {
              "ico": "fab fa-java",
              "desc": "Основният език за програмиране, беше Java."
            },
            "db": {
              "ico": "mdi-database",
              "desc": "Използвахме онлайн база данни за интерпретиране на баркодовете."
            },
            "github": {
              "ico": "fab fa-github",
              "desc": "Използвахме GitHub за контрол на версиите."
            }
          }
        },
        "pmg": {
          "time": "Септември 2006 - Май 2018",
          "name": "Природо-математическа гимназия ''Добри Чинтулов''",
          "position": "Ученик",
          "desc": {
            "s1": "Гимназията, която завърших, се смяташе за най-елитната образователна институция в града. Профилът ми беше ''Математика, информатика и английски език''.",
            "s2": "По време на обучението си там участвах активно в състезания за БАН, СМБ и много други. Два от проектите ми спечелиха награда за отлично представяне, а друг спечели два пъти специална награда за значителен социален принос. Освен това се явих в редица математически състезания и спечелих над 14 от тях."
          },
          "sk": {
            "github": {
              "ico": "fab fa-github",
              "desc": "Използвах GitHub за контрол на версиите на проектите си."
            },
            "embed": {
              "ico": "mdi-chip",
              "desc": "Правих много от проектите си, използвайки вградени системи като Arduino, Raspberry Pi, TI Launchpad и други."
            },
            "web": {
              "ico": "mdi-web",
              "desc": "Тук и започнах да уча фундаменталните части на уеб - HTML, CSS и JS."
            }
          }
        }
      },
      "proj": {
        "title": "Проекти, инструменти и умения",
        "proj": {
          "used": "Използвани програми/езици: ",
          "pear": {
            "title": "Pear Review",
            "assoc": "В асоциация с университет Пасау",
            "desc": "Pear Review е най-големият проект, който съм правил. Трябваше да разработя Java уеб приложение като система за рецензии на научни статии, заедно с още четирима души. Проектът беше част от задължителния стаж за моята степен. Готовият продукт съдържаше повече от 22 000 реда код и повече от 250 страници документация, планиране и валидиране. Tъй като приложението беше за университета, то трябваше да бъде направено като по учебник: трябваше да се предвидят всички мерки за сигурност, connection pool, замозатварящи се връзки с базата данни, всички таблици бяха в BCNF, създаване на временни токени и т.н.",
            "tools": "Jakarta Server Faces, Primefaces, Omnifaces, PostgreSQL, JUnit, Selenium, LaTeX."
          },
          "gimms": {
            "title": "GiiMMS",
            "assoc": "В асоциация с университет Пасау",
            "desc": "Full stack система за управление на служители за курса Уеб и дата инженерство.",
            "tools": "Spring Boot, Thymeleaf, JPA, IntelliJ IDEA."
          },
          "kittn": {
            "title": "Kittn me",
            "assoc": "Собствен проект",
            "desc": "Full stack социална медия с котешки мотив, които направих за забавление и да науча нови умения.",
            "tools": "React, Redux, Firebase, Busboy, Dicer, Streamsearch."
          },
          "abalone": {
            "title": "AI Abalone",
            "assoc": "В асоциация с университет Пасау",
            "desc": "Проект изцяло на Java за курса за напреднали по програмиране. Състои се от играта Abalone с GUI, с възможност за играе срещу компютъра на различни нива на трудност. Проектът се изпълнява само с математика и алгоритъма min-max.",
            "tools": "Java, Swing, JUnit."
          },
          "homie": {
            "title": "Homie Home Automation",
            "assoc": "Собствен проект",
            "desc": "Система за интелигентен дом, която в отбор с двама създадохме за IT състезания.",
            "tools": "Python, PHP, Arduino, Raspberry Pi, TI Launchpad."
          }
        },
        "skil": {
          "front-end": {
            "js": "Сертификат от ''СофтУни''.",
            "vue": "Проект, който използва Vue.js.",
            "react": "Проект, който използва React."
          },
          "private": "Private Repository, because of University policy. Please contact me for more info.",
          "server": {
            "thy": "Проект, който използва Thymeleaf."
          },
          "back-end": {
            "redux": "Проект, който използва Redux за back-end.",
            "spring": "Проект, който използва Spring Boot за back-end.",
            "js": "Сертификат за JavaScript applications от ''СофтУни''."
          },
          "gen": {
            "java": "доброволчество за TOM България.",
            "ch": "Проект, който направих за IT състезания в България.",
            "has": "Курс от Университет Пасау."
          },
          "db": {
            "mssql": "Курс от ''СофтУни''.",
            "firebase": "Проект, който използва Firebase за база данни.",
            "jpa": "Проект, който използва JPA за запазване на данните."
          },
          "tools": {
            "git": "Използвам git за контрол на версиите и колаборация на всичките си проекти.",
            "latex": "Използвам LaTeX за визуализиране на математика и писане на научни статии. Също имам и сертификат от пожелателен курс по този предмет в университета.",
            "r": "Пожелателен курс от университета със сертификат.",
            "dig-mar": "Сертификат от Гугъл.",
            "agile": "Сертификат от университета.",
            "mario": "Проект, който направихме в летния лагер по роботика. Имам също и множество проекти с Arduino, Raspberri Py, курсове и сертификати от ''СофтУни'' и други места."
          }
        }
      },
      "cont":{
        "title":"Контакт",
        "text":{
          "I-am":"В момента търся активно ",
          "freelance":"фрийланс услуги",
          "work":" и/или интересни ",
          "job":"възможности за работа",
          "email":", така че изпрати ми имейл."
        },
        "get-in-touch":"Свържи се с мен",
        "coffee":"Спонсорирай ме"
      }
    }