{
  "home": {
    "my-name-is": "Здравей! Аз съм",
    "radoslav-mandev": "Радослав Мъндев",
    "build-and-research": "Създавам и проучвам неща",
    "rotator": {
      "for-the-web": "за уеб",
      "for-android": "за квантова криптография",
      "java": "с Java",
      "crypto": "за криптография и киберсигурност",
      "js": "с JavaScript"
    },
    "I-am": "Студент, който учи",
    "cs-stud": "информатика",
    "spec": " и специализира в",
    "web-dev": "софтуерно инженерство",
    "and": "и",
    "cybersec": "киберсигурност",
    "special":"",
    "get-in-touch": "свържи се с мен",
    "right-nav": {
      "about": "За мен",
      "experience": "Опит",
      "projects": "Проекти",
      "contact": "Контакт"
    }
  },
  "main": {
    "built-by-me": "Създаден от мен"
  },
  "about": {
    "about-me": "За мен",
    "me": {
      "my-name-is": "Казвам се ",
      "radoslav-mandev": "Радослав Мъндев",
      "born-in": " и съм роден през 1999г. в България."
    },
    "study": {
      "degree": "В момента изучавам специалността ",
      "cs": "информатика",
      "at": " в ",
      "uni": "университет Пасау",
      "de": ", Германия",
      "liv": " и живея във ",
      "vi": "Виена"
    },
    "field": {
      "passion": "Когато бях на 13 се запалих по всичко свързано с ",
      "tech": "технологии",
      "web": "уеб",
      "and": " и ",
      "cybersecurity": "киберсигурност",
      "programming": "програмиране"
    },
    "hobbies": {
      "enjoy": "В свободното си време обичам да се занимавам с ",
      "reading": "четене",
      "doing": ",  ",
      "photo": "снимане",
      "espresso": ", търсене на геокешове, правене на качествено кафе (specialty coffee), ",
      "biking": "планинско колоездене",
      "orienteering": " или ориентиране"
    }
  },
  "exp": {
    "done": "Опит",
    "uni": {
      "time": "Септември 2018 - Сега",
      "name": "Университет Пасау",
      "position": "Бакалавър информатика",
      "desc": {
        "s1": "Близо съм до завършването на бакалавърската си степен в областта компютърни науки, водена изцяло на немски език. По време на обучението си в този университет, фокусиран върху научните изследвания, придобих множество ценни умения.",
        "s2": "В задължителните курсове научих всичко за математически анализи, линейна алгебра, стохастика, информатика (теоретична и практическа), компютърна архитектура, мрежи, разпределени системи, бази данни, IT-сигурност и много други. Знанията, които получих по време на тези лекции, бяха безценни и изградиха основата на моето разбиране в областта на информатиката.",
        "s3": "Друга ключова част от моето обучение беше стажът, който направих в университета. Основната част беше голямо full-stack Java приложение и свързаните с него бази данни, защита срещу атаки, множество видове тестване, документация и т.н. Голям акцент беше поставен върху сигурността, за която отговарях аз. Извършването на стажа в университета, а не в компания, беше от голяма полза за мен, защото бях наставляван внимателно и грешките ми бяха коригирани, както и обяснени от моя учител.",
        "s4": "Последната част от обучението ми се състоеше от моята дипломна теза и семинарна работа. В дипломната си работа трябваше да внедря множество схеми за подписване в ''след квантова криптография'' в рамките на популярния имейл клиент с отворен код K-9 Mail, за да позволя на всеки да изпраща имейли, подписани от алгоритми, които са безопасни от атаки от квантови компютри. Семинарната ми работа беше за намиране на уязвимости в BLE."
      },
      "sk": {
        "java": {
          "ico": "fab fa-java",
          "desc": "Всичко свързано с Java, включително голяма част JSF, паралелно програмиране и много други области."
        },
        "spring": {
          "ico": "fab fa-envira",
          "desc": "Spring Boot използвах в лекцията по ''Web and Data Engineering''."
        },
        "git": {
          "ico": "fab fa-git",
          "desc": "Като система за контрол на версиите съм използвал git, както и лична GitLab имплементация на университета."
        },
        "haskell": {
          "ico": "mdi-language-haskell",
          "desc": "Изучавах езика Haskell в лекциите по теоретична информатика."
        },
        "c": {
          "ico": "mdi-language-c",
          "desc": "Изучавах езика C в лекциите по теоретична информатика."
        },
        "r": {
          "ico": "mdi-language-r",
          "desc": "Изучавах езика R в изборен курс."
        },
        "db": {
          "ico": "mdi-database-search",
          "desc": "Изучавах PostgreSQL в много лекции за бази данни."
        },
        "net": {
          "ico": "mdi-access-point-network",
          "desc": "Изучавах компютърните мрежи в лекции относно тях."
        },
        "lat": {
          "ico": "mdi-format-text",
          "desc": "Всички проучвания, документации и домашни писах на LaTeX."
        },
        "sec": {
          "ico": "mdi-security",
          "desc": "Научих много за IT-сигурността през лекции, бакалавърската си теза и семинар."
        }
      }
    },
    "free": {
      "time": "през 2018",
      "name": "Свободна практика",
      "desc": {
        "s1": "Преди да започна бакалавъра си в Германия работих на свободна практика, за да науча повече неща относно програмирането. Изработвах основно портфолио уебсайтове за клиентите си."
      },
      "sk": {
        "github": {
          "ico": "fab fa-github",
          "desc": "Използвах GitHub за контрол на версиите."
        },
        "boot": {
          "ico": "mdi-bootstrap",
          "desc": "Използвах Bootstrap за да подобря естетиката."
        },
        "word": {
          "ico": "mdi-wordpress",
          "desc": "Използвах Wordpress за уебсайта на клуба по ориентиране, в който членувах."
        },
        "html": {
          "ico": "mdi-language-html5",
          "desc": "Използвах HTML5 за front-end."
        },
        "css": {
          "ico": "mdi-language-css3",
          "desc": "Използвах CSS3 за front-end."
        },
        "js": {
          "ico": "mdi-language-javascript",
          "desc": "Използвах JavaScript за front-end."
        },
        "vsc": {
          "ico": "mdi-microsoft-visual-studio-code",
          "desc": "VSCode беше интегрираната среда за разработка, която избирах за повечето си проекти."
        }
      }
    },
    "softuni": {
      "time": "Октомври 2015 - Август 2018",
      "name": "Софтуерен Университет ''СофтУни''",
      "position": "C# Web Developer",
      "desc": {
        "s1": "В продължение на 3 години учих в българската академия за софтуерни разработчици ''СофтУни''.  Професионалното ми направиление беше C# Web Developer и включваше курсове като  C# Advanced, MVC, ASP.NET, както и такива, свързани с бази данни, работа в екип и entity framework. Участвах също и в много допълнителни курсове извън програмата като Arduino, JS Applications, мултимедия и офис приложения.",
        "s2": "''СофтУни'' до голяма степен допринесе за развитието ми, защото това е мястото, където започнах сериозно да се занимавам с програмиране."
      },
      "sk": {
        "ch": {
          "ico": "mdi-language-csharp",
          "desc": "Завърших общо 6 курса, базиращи се на C#, тъй като това ми беше специалността."
        },
        "js": {
          "ico": "mdi-language-javascript",
          "desc": "Записах избираеми курсове за JavaScript за front-end, back-end, applications и advanced."
        },
        "java": {
          "ico": "fab fa-java",
          "desc": "Записах и два допълнителни курса за Java."
        },
        "vs": {
          "ico": "mdi-microsoft-visual-studio",
          "desc": "Visual studio беше интегрираната среда за разработка, която използвах най-много."
        }
      }
    },
    "green": {
      "time": "Октомври 2016",
      "name": "Greenpeace (доброволчество)",
      "position": "IoT Инженер",
      "desc": {
        "s1": "Бях доброволец в проект, организиран от ''Greenpeace'', който целеше да оцени чистотата на въздуха в големите градове в България. Тази задача осъществихме чрез вградена система, състояща се от IoT устройство и уеб сървър, който събираше и обработваше данните."
      },
      "sk": {
        "chip": {
          "ico": "mdi-chip",
          "desc": "Основната част на устройството се състоеше от ATmega328P."
        },
        "web": {
          "ico": "mdi-web",
          "desc": "За уеб-интерфейса използвахме HTML, CSS, JS и PHP."
        }
      }
    },
    "tom": {
      "time": "Март 2016, Октомври 2017",
      "name": "Tikkum Olam Makers (доброволчество)",
      "position": "Софтуерен Инженер",
      "desc": {
        "s1": "Бях доброволец в двете издания на TOM България. TOM е популярно международно движение, което използва постиженията на съвременния дизайн и технология в помощ на хора със специални нужди. Моите задачи бяха свързани с проектиране и разработване на хардуерни и софтуерни решения."
      },
      "sk": {
        "chip": {
          "ico": "mdi-chip",
          "desc": "В първия проект използвахме Arduino, за да контролираме мотори, соленоиди и разчитаме показанията на сензори."
        },
        "andr": {
          "ico": "mdi-android",
          "desc": "Вторият проект се състоеше основно от приложение за Android."
        },
        "java": {
          "ico": "fab fa-java",
          "desc": "Основният език за програмиране беше Java."
        },
        "db": {
          "ico": "mdi-database",
          "desc": "Използвахме онлайн база данни за интерпретиране на баркодовете."
        },
        "github": {
          "ico": "fab fa-github",
          "desc": "Използвахме GitHub за контрол на версиите."
        }
      }
    },
    "pmg": {
      "time": "Септември 2006 - Май 2018",
      "name": "Природо-математическа гимназия ''Добри Чинтулов''",
      "position": "Ученик",
      "desc": {
        "s1": "Гимназията, която завърших, се смяташе за най-елитната образователна институция в града. Профилът ми беше ''Математика, информатика и английски език''.",
        "s2": "По време на обучението си там участвах активно в състезания за БАН, СМБ и много други. Два от проектите ми спечелиха награда за отлично представяне, а друг спечели два пъти специална награда за значителен социален принос. Освен това се явих в редица математически състезания и спечелих над 14 от тях."
      },
      "sk": {
        "github": {
          "ico": "fab fa-github",
          "desc": "В проектите си използвах GitHub за контрол на версиите."
        },
        "embed": {
          "ico": "mdi-chip",
          "desc": "Използвах в много от проектите си вградени системи като Arduino, Raspberry Pi, TI Launchpad и др."
        },
        "web": {
          "ico": "mdi-web",
          "desc": "Тук започнах да уча фундаменталните части на уеб - HTML, CSS и JS."
        }
      }
    }
  },
  "proj": {
    "title": "Проекти, инструменти и умения",
    "proj": {
      "used": "Използвани програми/езици: ",
      "pqc": {
        "title": "Post-Quantum K-9 Mail",
        "assoc": "В асоциация с университет Пасау",
        "desc": "Последният ми проект и фокусът на моята дипломна работа. Фокусира се върху имплементирането и сравняването на алгоритми за следквантова криптография (PQC) за подписване на имейли като добавка за клиент за електронна поща с отворен код. Най-трудните части на проекта се крият в намирането на начин за компилиране на PQC библиотека за Android и разбирането и прилагането на PQC алгоритмите в рамките на голяма кодова база.",
        "tools": "Kotlin, Java, SQL, Android Studio, Gradle, Selenium, JUnit, Mockito, LaTeX"
      },
      "pear": {
        "title": "Pear Review",
        "assoc": "В асоциация с университет Пасау",
        "desc": "Pear Review е най-големият проект, с който съм се занимавал. Трябваше да разработя Java уеб приложение като система за рецензии на научни статии заедно с още четирима души. Проектът беше част от задължителния стаж за моята степен. Готовият продукт съдържаше повече от 22 000 реда код и повече от 250 страници документация, планиране и валидиране. Tъй като приложението беше за университета, то трябваше да бъде направено като по учебник: всички мерки за сигурност, connection pool, самозатварящи се връзки с базата данни, всички таблици бяха в BCNF, автоматично се създаваха временни токени и т.н.",
        "tools": "Jakarta Server Faces, Primefaces, Omnifaces, PostgreSQL, JUnit, Selenium, LaTeX."
      },
      "gimms": {
        "title": "GiiMMS",
        "assoc": "В асоциация с университет Пасау",
        "desc": "Full stack система за управление на служители за курса ''Web and Data Engineering''.",
        "tools": "Spring Boot, Thymeleaf, JPA, IntelliJ IDEA."
      },
      "kittn": {
        "title": "Kittn me",
        "assoc": "Собствен проект",
        "desc": "Full stack социална медия с котешки мотив, която направих за забавление и с цел да придобия нови умения.",
        "tools": "React, Redux, Firebase, Busboy, Dicer, Streamsearch."
      },
      "abalone": {
        "title": "AI Abalone",
        "assoc": "В асоциация с университет Пасау",
        "desc": "Проект изцяло на Java за курса за напреднали по програмиране. Състои се от играта Abalone с GUI, с възможност за игра срещу компютъра с различни нива на трудност. Проектът се изпълнява само с математика и алгоритъма min-max.",
        "tools": "Java, Swing, JUnit."
      }
    },
    "skil": {
      "front-end": {
        "js": "Сертификат от ''СофтУни''",
        "vue": "Проект, който използва Vue.js",
        "react": "Проект, който използва React",
        "html5" : "Проект, който използва HTML5",
        "css" : "Сертификат от СофтУни"
      },
      "private": "Частно хранилище поради политиката на университета. Моля, свържете се с мен за повече информация.",
      "server": {
        "thy": "Проект, който използва Thymeleaf"
      },
      "back-end": {
        "redux": "Проект, който използва Redux за back-end",
        "spring": "Проект, който използва Spring Boot за back-end",
        "js": "Сертификат за JavaScript applications от ''СофтУни''"
      },
      "gen": {
        "java": "Основно в университета, собствени проекти и доброволчество",
        "kot" : "Имплементирах дипломната си работа в Котлин",
        "ch": "Проект, който направих за IT състезания в България",
        "has": "Курс от Университет Пасау"
      },
      "db": {
        "mssql": "Курс от ''СофтУни''.",
        "firebase": "Проект, който използва Firebase за база данни",
        "jpa": "Проект, който използва JPA за запазване на данните"
      },
      "tools": {
        "git": "Използвам git за контрол на версиите във всичките си проекти.",
        "latex": "Използвам LaTeX за визуализиране на математически формули и писане на научни статии. Също така имам сертификат от избирателен курс по този предмет в университета.",
        "r": "Сертификат от университета",
        "dig-mar": "Сертификат от Google",
        "agile": "Сертификат от университета",
        "mario": "Проект, който направихме в летния лагер по роботика. Имам също много проекти с Arduino, Raspberry Pi, курсове и сертификати от ''СофтУни'' и други институции.",
        "restapi" : "Проект, който използва REST API"
      }
    }
  },
  "cont": {
    "title": "Контакт",
    "text": {
      "I-am": "В момента търся активно ",
      "freelance": "услуги на свободна практика",
      "work": " и/или интересни ",
      "job": "възможности за работа",
      "email": ", така че изпрати ми имейл."
    },
    "get-in-touch": "Свържи се с мен",
    "coffee": "Спонсорирай ме"
  }
}