{
  "home": {
    "my-name-is": "Hallo, mein Name ist",
    "radoslav-mandev": "Radoslav Mandev",
    "build-and-research": "Ich entwickle und forsche Dinge",
    "rotator": {
      "for-the-web": "für das Web",
      "for-android": "für Android",
      "java": "mit Java",
      "crypto": "über Kriptographie und Schwachstellen",
      "js": "mit JavaScript"
    },
    "I-am": "Ich bin ein",
    "cs-stud": "Informatik Student",
    "spec": ", der sich auf",
    "web-dev": "Softwareentwicklung",
    "and": "und",
    "cybersec": "Cybersicherheit",
    "special": " spezializiert hat",
    "get-in-touch": "Get in touch",
    "right-nav": {
      "about": "Über mich",
      "experience": "Erfahrung",
      "projects": "Projekte",
      "contact": "Kontakt"
    }
  },
  "main": {
    "built-by-me": "Von mir gemacht"
  },
  "about": {
    "about-me": "Über mich",
    "me": {
      "my-name-is": "Mein Name ist ",
      "radoslav-mandev": "Radoslav Mandev",
      "born-in": " und ich wurde 1999 in Bulgarien geboren."
    },
    "study": {
      "degree": "Ich studiere derzeit ",
      "cs": "Informatik",
      "at": " an der ",
      "uni": "Universität Passau",
      "de": ", Deutschland",
      "liv": " und lebe in ",
      "vi": "Wien"
    },
    "field": {
      "passion": "Seit dem ich 13. Jarh war interessiere ich mich leidenschaftlich für alles rund um ",
      "tech": "Tech",
      "web": "Web",
      "and": " und ",
      "cybersecurity": "Cybersicherheit",
      "programming": "Programmierung"
    },
    "hobbies": {
      "enjoy": "In meiner Freizeit ",
      "reading": "lese",
      "doing": " ich gerne, ",
      "photo": "fotografiere",
      "espresso": ", suche Geocachen, mache Spezialitätenkaffee (specialty coffee), ",
      "biking": "Mountainbiken",
      "orienteering": " oder Orientierung"
    }
  },
  "exp": {
    "done": "Erfahrung",
    "uni": {
      "time": "September 2018 - Heute",
      "name": "Universität Passau",
      "position": "Bachelor Informatik",
      "desc": {
        "s1": "Ich stehe kurz vor dem Abschluss meines Bachelor-Studiums in Informatik, das komplett auf Deutsch durchgeführt wird. Während meines Studiums an dieser forschungsorientierten Universität habe ich eine Fülle wertvoller Fähigkeiten erworben.",
        "s2": "In den Pflichtfächern habe ich alles über mathematische Analysis, Lineare Algebra, Stochastik, Informatik (sowohl theoretisch als auch praktisch), Computerarchitektur, Netzwerke, Verteilte Systeme, Datenbanken, IT-Sicherheit und vieles mehr gelernt. Das Wissen, das ich während dieser Vorlesungen gewonnen habe, war von unschätzbarem Wert und bildete die Grundlage für mein Verständnis im Bereich der Informatik.",
        "s3": "Ein weiterer wichtiger Bestandteil meiner Studiums war das Praktikum, das ich für die Universität absolviert habe. Der Hauptteil war eine große Full-Stack-Java-Anwendung und die damit verbundenen Datenbankverbindungen, Schutz vor Angriffen, verschiedene Arten von Tests, Dokumentation usw. Ein großer Schwerpunkt wurde auf die Sicherheit gelegt, für die ich verantwortlich war. Das Praktikum an der Universität und nicht in einem Unternehmen zu absolvieren, war für mich von großem Wert. Ich wurde eng betreut und meine Fehler wurden von meinem Tutor korrigiert und erklärt.",
        "s4": "Der letzte Teil meines Studiums bestand aus meiner Bachelorarbeit und einer Seminararbeit. In meiner Bachelorarbeit musste ich mehrere Post-Quantenkryptographie-Signaturverfahren in den beliebten Open-Source E-Mail Client K-9 Mail implementieren, um es jedem zu ermöglichen, E-Mails zu versenden, die mit Algorithmen signiert sind, die vor Angriffen von Quantencomputern sicher sind. In meiner Seminararbeit ging es darum, Schwachstellen in BLE zu finden."
      },
      "sk": {
        "java": {
          "ico": "fab fa-java",
          "desc": "Java, innen und außen: JSF, parallele Programmierung und vieles mehr."
        },
        "spring": {
          "ico": "fab fa-envira",
          "desc": "Ich habe Spring Boot im Kurs ''Web and Data Engineering'' verwendet."
        },
        "git": {
          "ico": "fab fa-git",
          "desc": "Die Versionskontrolle wurde mit einer privaten GitLab-Implementierung für die Universität abgewickelt."
        },
        "haskell": {
          "ico": "mdi-language-haskell",
          "desc": "In den theoretischen Informatikkursen habe ich einiges an Haskell gelernt."
        },
        "c": {
          "ico": "mdi-language-c",
          "desc": "In den theoretischen Informatikkursen habe ich einiges C gelernt."
        },
        "r": {
          "ico": "mdi-language-r",
          "desc": "Ich habe während einer Vorlesung über die Sprache etwas R gelernt."
        },
        "db": {
          "ico": "mdi-database-search",
          "desc": "Ich habe in mehreren Kursen über Datenbanken PostgreSQL gelernt."
        },
        "net": {
          "ico": "mdi-access-point-network",
          "desc": "In Kursen wie ''Verteilte Systeme'' und ''Netzwerke'' habe ich einiges über Rechnernetze gelernt."
        },
        "lat": {
          "ico": "mdi-format-text",
          "desc": "Alle Recherchen, Dokumentationen und Hausaufgaben wurden mit LaTeX geschrieben."
        },
        "sec": {
          "ico": "mdi-security",
          "desc": "Ich habe in Vorlesungen, meiner Bachelorarbeit und meiner Seminararbeit viel über Cybersecurity gelernt."
        }
      }
    },
    "free": {
      "time": "durch 2018",
      "name": "Freelancer",
      "desc": {
        "s1": "Bevor ich mein Bachelorstudium in Deutschland begonnen habe, habe ich als Freelancer gearbeitet, um mehr über das Programmieren zu lernen. Ich habe hauptsächlich Portfolio-Websites für Kunden entwickelt."
      },
      "sk": {
        "github": {
          "ico": "fab fa-github",
          "desc": "Zur Versionskontrolle habe ich GitHub verwendet."
        },
        "boot": {
          "ico": "mdi-bootstrap",
          "desc": "Ich habe Bootstrap verwendet, um die Dinge hübsch zu machen."
        },
        "word": {
          "ico": "mdi-wordpress",
          "desc": "Ich habe WordPress verwendet, um eine Website für unseren Orientierungsclub zu erstellen."
        },
        "html": {
          "ico": "mdi-language-html5",
          "desc": "Als Front-end habe ich HTML5 verwendet."
        },
        "css": {
          "ico": "mdi-language-css3",
          "desc": "Als Front-end habe ich CSS3 verwendet."
        },
        "js": {
          "ico": "mdi-language-javascript",
          "desc": "Als Front-end habe ich JavaScript verwendet."
        },
        "vsc": {
          "ico": "mdi-microsoft-visual-studio-code",
          "desc": "VSCode war meine bevorzugte IDE."
        }
      }
    },
    "softuni": {
      "time": "Oktober 2015 - August 2018",
      "name": "Software Universität",
      "position": "C# Web Developer",
      "desc": {
        "s1": "Ich habe 3 Jahre lang an der bulgarischen Akademie der Softwareentwickler „SoftUni“ studiert. Mein Hauptgebiet war C# Web Developer und umfasste Kursen wie C# Advanced, MVC, ASP.NET und vielem mehr über Datenbanken, Teamwork, Entity Framework usw. Ich habe auch an anderen freiwilligen Kursen wie Arduino, JS-Anwendungen, Multimedia und Office-Anwendungen teilgenommen.",
        "s2": "''SoftUni'' hat viel zu meiner Entwicklung beigetragen, weil ich hier angefangen habe, mich ernsthaft mit dem Programmieren zu beschäftigen."
      },
      "sk": {
        "ch": {
          "ico": "mdi-language-csharp",
          "desc": "Ich habe 6 Kurse für C# absolviert, da es mein Fachgebiet war."
        },
        "js": {
          "ico": "mdi-language-javascript",
          "desc": "Ich habe freiwillige Kurse zu JavaScript für Frontend, Backend, Aplications und Advanced absolviert."
        },
        "java": {
          "ico": "fab fa-java",
          "desc": "Ich habe zwei Kurse für Java absolviert."
        },
        "vs": {
          "ico": "mdi-microsoft-visual-studio",
          "desc": "Visual Studio war dort die meistgenutzte IDE von mir."
        }
      }
    },
    "green": {
      "time": "Oktober 2016",
      "name": "Greenpeace (Freiwilligenarbeit)",
      "position": "IoT Engineer",
      "desc": {
        "s1": "Ich habe mich freiwillig für ein von Greenpeace organisiertes Projekt teilgenommen, das darauf abzielte, die Sauberkeit der Luft in großen Städten Bulgariens zu bewerten. Diese Aufgabe wurde durch ein eingebettetes System ausgeführt, das aus einem IoT-Gerät und einem Webserver besteht, der die Daten sammelt und verarbeitet."
      },
      "sk": {
        "chip": {
          "ico": "mdi-chip",
          "desc": "Der größte Teil bestand aus ATmega328P."
        },
        "web": {
          "ico": "mdi-web",
          "desc": "Das Webinterface der Geräte haben wir mit HTML, CSS, JS und PHP gestaltet."
        }
      }
    },
    "tom": {
      "time": "März 2016, Oktober 2017",
      "name": "Tikkum Olam Makers (Freiwilligenarbeit)",
      "position": "Software Engineer",
      "desc": {
        "s1": "Ich habe in die beiden Ausgaben von TOM Bulgaria teilgenommen. Der Sinn der internationale TOM-Bewegung besteht darin, Innovatoren mit Menschen mit Behinderungen zusammenzubringen, um Open-Source-Lösungen für vernachlässigte Herausforderungen zu entwickeln und zu verbreiten. Meine Aufgaben betrafen die Konzeption und Entwicklung von Hard- und Softwarelösungen."
      },
      "sk": {
        "chip": {
          "ico": "mdi-chip",
          "desc": "Im ersten Projekt haben wir Arduinos zur Bewegungssteuerung und Sensormessung verwendet."
        },
        "andr": {
          "ico": "mdi-android",
          "desc": "Das zweite Projekt war für Android."
        },
        "java": {
          "ico": "fab fa-java",
          "desc": "Java war die Hauptsprache, die verwendet wurde."
        },
        "db": {
          "ico": "mdi-database",
          "desc": "Wir haben eine Online-Datenbank mit QR-Codes verwendet."
        },
        "github": {
          "ico": "fab fa-github",
          "desc": "Wir haben GitHub für die Versionskontrolle verwendet."
        }
      }
    },
    "pmg": {
      "time": "September 2006 - Mai 2018",
      "name": "Nationales Gymnasium für Naturwissenschaften und Mathematik",
      "position": "Schüler",
      "desc": {
        "s1": "Das Gymnasium, das ich absolvierte, galt als die beste Bildungseinrichtung der Stadt. Mein Profil war ''Mathematik, Informatik und Englisch''.",
        "s2": "Während meines Studiums habe ich aktiv an Wettbewerben für die Bulgarische Akademie der Wissenschaften, die Union der bulgarischen Mathematiker und viele mehr teilgenommen. Zwei meiner Projekte wurden mit einem ausgezeichneten Präsentationspreis und eines zweimal mit einem Sonderpreis für einen bedeutenden sozialen Beitrag ausgezeichnet. Außerdem habe ich an mehreren Mathematikwettbewerben teilgenommen und über 14 davon gewonnen."
      },
      "sk": {
        "github": {
          "ico": "fab fa-github",
          "desc": "Zur Versionskontrolle habe ich GitHub verwendet."
        },
        "embed": {
          "ico": "mdi-chip",
          "desc": "Ich habe viele Projekte mit eingebetteten Systemen wie Arduino, Raspberry Pi, TI Launchpad und mehr entwickelt."
        },
        "web": {
          "ico": "mdi-web",
          "desc": "Hier fing ich an, die Essenz des Webs zu lernen - HTML, CSS und JS."
        }
      }
    }
  },
  "proj": {
    "title": "Projekte, Werkzeuge und Fähigkeiten die ich verwendet habe",
    "proj": {
      "used": "Gebrauchte Werkzeuge: ",
      "pqc": {
        "title": "Post-Quantum K-9 Mail",
        "assoc": "Assoziiert mit der Universität Passau",
        "desc": "Das Hauptprojekt und der Schwerpunkt meiner Bachelorarbeit. Es konzentriert sich auf die Implementierung und den Vergleich von Post-Quantum Cryptography (PQC) Algorithmen zum Signieren von E-Mails als Add-on für einen Open Source E-Mail-Client. Die schwierigsten Teile des Projekts liegen darin, einen Weg zu finden, eine PQC-Bibliothek für Android zu kompilieren und die PQC-Algorithmen innerhalb einer großen Codebasis zu verstehen und zu implementieren",
        "tools": "Kotlin, Java, SQL, Android Studio, Gradle, Selenium, JUnit, Mockito, LaTeX"
      },
      "pear": {
        "title": "Pear Review",
        "assoc": "Assoziiert mit der Universität Passau",
        "desc": "Pear Review ist das größte Projekt, das ich gemacht habe. Ich musste zusammen mit vier weiteren Personen eine Java-Webanwendung als System für die Peer-Review von wissenschaftlichen Artikeln entwickeln. Das Projekt war Teil des Pflichtpraktikums für mein Studium. Das fertige Produkt enthielt mehr als 22.000 Codezeilen und mehr als 250 Seiten Dokumentation, Planung und Validierung. Da die Aufgabe für die Universität war, musste wie im Lehrbuch vorgegangen werden: Alle Sicherheitsmaßnahmen mussten berücksichtigt werden, Connection Pooling, automatisches Schließen von Verbindungen, Tabellen in der Datenbank waren in BCNF, Redundanz, Token generation usw.",
        "tools": "Jakarta Server Faces, Primefaces, Omnifaces, PostgreSQL, JUnit, Selenium, LaTeX."
      },
      "gimms": {
        "title": "GiiMMS",
        "assoc": "Assoziiert mit der Universität Passau",
        "desc": "Ein Full-Stack Mitarbeiterverwaltungssystem für den Kurs ''Web and Data Engineering''.",
        "tools": "Spring Boot, Thymeleaf, JPA, IntelliJ IDEA."
      },
      "kittn": {
        "title": "Kittn me",
        "assoc": "Persönliches Projekt",
        "desc": "Ein Full-Stack Cat-Themen Social Media Website, das ich nur zum Spaß gemacht habe und um neue Fähigkeiten zu erlernen.",
        "tools": "React, Redux, Firebase, Busboy, Dicer, Streamsearch."
      },
      "abalone": {
        "title": "AI Abalone",
        "assoc": "Assoziiert mit der Universität Passau",
        "desc": "Ein reines Java Projekt für den Fortgeschrittenenkurs in Programmierung. Es besteht aus dem Spiel Abalone mit GUI, so dass es möglich ist, in verschiedenen Schwierigkeitsgraden gegen den Computer zu spielen. Das Projekt wird nur mit Mathematik und dem Min-Max-Algorithmus durchgeführt.",
        "tools": "Java, Swing, JUnit."
      }
    },
    "skil": {
      "front-end": {
        "js": "Zertifikat von ''SoftUni''",
        "vue": "Projekt, das verwendet Vue.js",
        "react": "Projekt, das verwendet React",
        "html5" : "Projekt, das verwendet HTML5",
        "css" : "Zertifikat von ''SoftUni''"
      },
      "private": "Privates Repository, aufgrund der Universitätspolitik. Bitte kontaktiere mich für weitere Informationen.",
      "server": {
        "thy": "Projekt, das verwendet Thymeleaf"
      },
      "back-end": {
        "redux": "Projekt, das verwendet Redux for back-end",
        "spring": "Projekt, das verwendet Spring Boot for back-end",
        "js": "Zertifikat für JavaScript Anwendungen von ''SoftUni''"
      },
      "gen": {
        "java": "Hauptsächlich von der Universität, Nebenprojekten und Freiwilligenarbeit gelernt",
        "kot": "Meine Bachelorarbeit habe ich in Java und Kotlin geschrieben",
        "ch": "Ein Projekt, das ich für IT-Wettbewerbe in Bulgarien erstellt habe",
        "has": "Kurs von der Universität"
      },
      "db": {
        "mssql": "Kurs von ''SoftUni''",
        "firebase": "Projekt, das Firebase für eine Datenbank verwendet",
        "jpa": "Projekt, das JPA als Speicher verwendet"
      },
      "tools": {
        "git": "Ich benutze git für alle meine Projekte.",
        "latex": "Ich verwende LaTeX für mathematische Formeln und wissenschaftliche Artikel. Ich habe auch ein Zertifikat von einem Universitätskurs zu diesem Thema.",
        "r": "Universität Kurs mit Zertifikat",
        "dig-mar": "Zertifikat von Google",
        "agile": "Zertifikat von Universität",
        "mario": "Projekt, das wir im Robotik Sommercamp gemacht haben. Ich habe mehrere Projekte mit Arduino und Raspberry Pi erstellt und ein Zertifikat von ''SoftUni'' erhalten.",
        "restapi" : "Projekt, das REST API verwendet"
      }
    }
  },
  "cont": {
    "title": "Kontakt",
    "text": {
      "I-am": "Ich suche aktuell ",
      "freelance": "freelance",
      "work": " work und/oder interessante ",
      "job": "Arbeitsmöglichkeiten",
      "email": ", also schick mir unbedingt eine email."
    },
    "get-in-touch": "kontaktiere mir",
    "coffee": "kauf mir einen kaffee"
  }
}