{
  "home": {
    "my-name-is": "Hallo, meine Name ist",
    "radoslav-mandev": "Radoslav Mandev",
    "build-and-research": "Ich entwickle und forsche Dinge",
    "rotator": {
      "for-the-web": "für das Web",
      "for-pq-crypto": "für Post-Quanten Kryptographie",
      "java": "mit Java",
      "ble": "für BLE Schwachstellen",
      "js": "mit JavaScript"
    },
    "I-am": "Ich bin ein",
    "cs-stud": "Informatik Student",
    "spec": ", der sich auf",
    "web-dev": "Webentwicklung",
    "and": "und",
    "cybersec": "Cybersicherheit",
    "special": " spezializiert hat",
    "get-in-touch": "Get in touch",
    "right-nav": {
      "about": "Über mich",
      "experience": "Erfahrung",
      "projects": "Projekte",
      "contact": "Kontakt"
    }
  },
  "main": {
    "built-by-me": "Von mir gemacht"
  },
  "about": {
    "about-me": "Über mich",
    "me": {
      "my-name-is": "Mein Name ist ",
      "radoslav-mandev": "Radoslav Mandev",
      "born-in": ", und ich wurde 1999 in Bulgarien geboren."
    },
    "study": {
      "degree": "Ich studiere derzeit ",
      "cs": "Informatik",
      "at": " an der ",
      "uni": "Universität Passau",
      "de": ", Deutschland"
    },
    "field": {
      "passion": "Seit meinem 13. Lebensjahr interessiere ich mich leidenschaftlich für alles rund um ",
      "tech": "Tech",
      "web": "Web",
      "and": " und ",
      "cybersecurity": "Cybersicherheit",
      "programming": "Programmierung"
    },
    "hobbies": {
      "enjoy": "In meiner Freizeit ",
      "reading": "lese",
      "doing": " ich gerne, ",
      "photo": "fotografiere",
      "espresso": ", suche Geocachen, mache Spezialitätenkaffee (specialty coffee), ",
      "biking": "Mountainbiken",
      "orienteering": " oder Orientierung"
    }
  },
  "exp": {
    "done": "Erfahrung",
    "uni": {
      "time": "September 2018 - Heute",
      "name": "Universität Passau",
      "position": "Bachelor Informatik",
      "desc": {
        "s1": "Im Moment mache ich meinen Bachelor auf Deutsch in Informatik. Während meines Studiums an dieser forschungsorientierten Universität habe ich eine Fülle wertvoller Fähigkeiten erworben.",
        "s2": "In den Pflichtfächern habe ich alles über Analysis, Lineare Algebra, Stochastik, Informatik (sowohl theoretisch als auch praktisch), Rechnerarchitektur, Netzwerke, Verteilte Systeme, Datenbanken, IT-Sicherheit und vieles mehr gelernt. Das Wissen, das ich in diesen Vorlesungen gewonnen habe, war von unschätzbarem Wert und bildete die Grundlage für mein Verständnis des Fachgebiets.",
        "s3": "Ein weiterer wichtiger Teil meines Studiums war das Praktikum, das ich für die Universität gemacht habe. Es handelte sich um ein großes Projekt, das ein Team ein ganzes Semester lang fertigstellen musste. Großer Wert wurde auf die Sicherheit gelegt, für die ich verantwortlich war. Das Praktikum an der Universität statt in einem Unternehmen zu fertigstellen, war für mich von großem Wert. Ich wurde eng betreut und meine Fehler wurden korrigiert und von meinem Tutor erklärt.",
        "s4": "Der letzte Teil meines Studiums besteht aus meiner Bachelorarbeit und Seminararbeit. Mein Thema ist Post-Quantum Kryptografie basierte Signatur Add-Ons für mobile Open-Source Anwendungen."
      },
      "sk": {
        "java": {
          "ico": "fab fa-java",
          "desc": "Java, innen und außen: JSF, parallele Programmierung und vieles mehr."
        },
        "spring": {
          "ico": "fab fa-envira",
          "desc": "Ich habe Spring Boot im Kurs ''Web and Data Engineering'' verwendet."
        },
        "git": {
          "ico": "fab fa-git",
          "desc": "Die Versionskontrolle wurde mit einer privaten GitLab-Implementierung für die Universität abgewickelt."
        },
        "haskell": {
          "ico": "mdi-language-haskell",
          "desc": "In den theoretischen Informatikkursen habe ich einiges an Haskell gelernt."
        },
        "c": {
          "ico": "mdi-language-c",
          "desc": "In den theoretischen Informatikkursen habe ich einiges C gelernt."
        },
        "r": {
          "ico": "mdi-language-r",
          "desc": "Ich habe während einer Vorlesung über die Sprache etwas R gelernt."
        },
        "db": {
          "ico": "mdi-database-search",
          "desc": "Ich habe in mehreren Kursen über Datenbanken PostgreSQL gelernt."
        },
        "net": {
          "ico": "mdi-access-point-network",
          "desc": "In Kursen wie ''Verteilte Systeme'' und ''Netzwerke'' habe ich einiges über Rechnernetze gelernt."
        },
        "lat": {
          "ico": "mdi-format-text",
          "desc": "Alle Recherchen, Dokumentationen und Hausaufgaben wurden mit LaTeX geschrieben."
        },
        "sec": {
          "ico": "mdi-security",
          "desc": "Ich habe in Vorlesungen, meiner Bachelorarbeit und meiner Seminararbeit viel über Cybersecurity gelernt."
        }
      }
    },
    "free": {
      "time": "durch 2018",
      "name": "Freelancer",
      "desc": {
        "s1": "Bevor ich meinen Bachelor in Deutschland anfing, habe ich als Freelancer gearbeitet, um mehr über das Programmieren zu lernen. Ich habe hauptsächlich Portfolio-Websiten für Kunden entwickelt."
      },
      "sk": {
        "github": {
          "ico": "fab fa-github",
          "desc": "Zur Versionskontrolle habe ich GitHub verwendet."
        },
        "boot": {
          "ico": "mdi-bootstrap",
          "desc": "Ich habe Bootstrap verwendet, um die Dinge hübsch zu machen."
        },
        "word": {
          "ico": "mdi-wordpress",
          "desc": "Ich habe WordPress verwendet, um eine Website für unseren Orientierungsclub zu erstellen."
        },
        "html": {
          "ico": "mdi-language-html5",
          "desc": "Als Front-end habe ich HTML5 verwendet."
        },
        "css": {
          "ico": "mdi-language-css3",
          "desc": "Als Front-end habe ich CSS3 verwendet."
        },
        "js": {
          "ico": "mdi-language-javascript",
          "desc": "Als Front-end habe ich JavaScript verwendet."
        },
        "vsc": {
          "ico": "mdi-microsoft-visual-studio-code",
          "desc": "VSCode war meine bevorzugte IDE."
        }
      }
    },
    "softuni": {
      "time": "Oktober 2015 - August 2018",
      "name": "Software Universität",
      "position": "C# Web Developer",
      "desc": {
        "s1": "Ich habe 3 Jahre an der bulgarischen Akademie für Softwareentwickler ''SoftUni'' studiert. Mein Hauptgebiet war C# Web Developer mit Kursen wie C# Advanced, MVC, ASP.NET und vielem mehr über Datenbanken, Teamwork, Entity Framework usw. Ich habe auch an anderen freiwilligen Kursen wie Arduino, JS-Applications, Multimedia und Office-Anwendungen teilgenommen.",
        "s2": " ''SoftUni'' ist ein grundlegender Teil dessen, was ich jetzt bin, da es der Ort ist, an dem ich ernsthaft mit dem Programmieren begonnen habe."
      },
      "sk": {
        "ch": {
          "ico": "mdi-language-csharp",
          "desc": "Ich habe 6 Kurse für C# absolviert, da es mein Fachgebiet war."
        },
        "js": {
          "ico": "mdi-language-javascript",
          "desc": "Ich habe freiwillige Kurse zu JavaScript für Frontend, Backend, Aplications und Advanced absolviert."
        },
        "java": {
          "ico": "fab fa-java",
          "desc": "Ich habe zwei Kurse für Java absolviert."
        },
        "vs": {
          "ico": "mdi-microsoft-visual-studio",
          "desc": "Visual Studio was the most used IDE from me there."
        }
      }
    },
    "green": {
      "time": "October 2016",
      "name": "Greenpeace (voluneer work)",
      "position": "IoT Engineer",
      "desc": {
        "s1": "I volunteered in a project organized by Greenpeace, that aims to assess the purity of the atmospheric air in the major cities in Bulgaria. This task was executed through an embedded system consisting of an IoT device and a web server that collected and processed the data."
      },
      "sk": {
        "chip": {
          "ico": "mdi-chip",
          "desc": "The biggest part consisted of ATmega328P."
        },
        "web": {
          "ico": "mdi-web",
          "desc": "We designed the web interface of the devices with HTML, CSS, JS and PHP."
        }
      }
    },
    "tom": {
      "time": "March 2016, October 2017",
      "name": "Tikkum Olam Makers (voluneer work)",
      "position": "Software Engineer",
      "desc": {
        "s1": "I volunteered twice in the two editions of TOM Bulgaria. The point of the TOM movement is connecting innovators to people with disabilities, in order to develop and disseminate open source solutions for neglected challenges. Together with a team we designed and developed hardware and software solutions for people in need."
      },
      "sk": {
        "chip": {
          "ico": "mdi-chip",
          "desc": "In the first project we used Arduinos for movement control and sensor measurement."
        },
        "andr": {
          "ico": "mdi-android",
          "desc": "The second project was for an Android phone."
        },
        "java": {
          "ico": "fab fa-java",
          "desc": "Java was the main language used."
        },
        "db": {
          "ico": "mdi-database",
          "desc": "We used an online database with QR-Codes."
        },
        "github": {
          "ico": "fab fa-github",
          "desc": "We used GitHub for version control."
        }
      }
    },
    "pmg": {
      "time": "September 2006 - May 2018",
      "name": "National Gymnasium of Natural Sciences and Mathematics",
      "position": "Student",
      "desc": {
        "s1": "The high school I graduated from was considered the best education in my town. My major was ''Mathematics, Informatics and English''.",
        "s2": "During my studies I actively took part in competitions for the Bulgarian Academy of Science, the Union of Bulgarian Mathematicians and many more. Two of my projects won an excellent presentation award and one won a special award for a significant social contribution twice. Furthermore I participated in numerous mathematical competitions and have won over 14 of them."
      },
      "sk": {
        "github": {
          "ico": "fab fa-github",
          "desc": "I used GitHub for version control."
        },
        "embed": {
          "ico": "mdi-chip",
          "desc": "I developed a lot of projects with embedded systems like Arduino, Raspberry Pi, TI Launchpad and more."
        },
        "web": {
          "ico": "mdi-web",
          "desc": "Here I started learning the essense of web - HTML, CSS and JS."
        }
      }
    }
  },
  "proj": {
    "title": "Projects, Tools and Skills I have used",
    "proj": {
      "used": "Used tools: ",
      "pear": {
        "title": "Pear Review",
        "assoc": "Accosiated with University Passau",
        "desc": "Pear Review is the biggest project I have participated in. I had to develop a Java Web Application as a system for peer review of scientific articles alongside four more people. The project was part of the mandatory internship for my degree. It ended up with more than 22,000 rows of code and more than 250 pages of documentation, planning and validation. Because the application was for the university it had to be done by the book: all security measures had to be accounted for, connection pooling, autoclosing connections, tables in the database were in BCNF, redundancy, tokens, etc.",
        "tools": "Jakarta Server Faces, Primefaces, Omnifaces, PostgreSQL, JUnit, Selenium, LaTeX."
      },
      "gimms": {
        "title": "GiiMMS",
        "assoc": "Accosiated with University Passau",
        "desc": "A full stack employee management system for the course Web and Data Engineering.",
        "tools": "Spring Boot, Thymeleaf, JPA, IntelliJ IDEA."
      },
      "kittn": {
        "title": "Kittn me",
        "assoc": "Personal project",
        "desc": "A full stack cat-themed social media that I did just for fun and to learn new skills.",
        "tools": "React, Redux, Firebase, Busboy, Dicer, Streamsearch."
      },
      "abalone": {
        "title": "AI Abalone",
        "assoc": "Accosiated with University Passau",
        "desc": "A Java only project for the advanced course in programming. It consists of the game Abalone with GUI, so that it is possible to play against the computer in different levels of difficulty. The project is done only with math and the min-max algorithm.",
        "tools": "Java, Swing, JUnit."
      },
      "homie": {
        "title": "Homie Home Automation",
        "assoc": "Personal project",
        "desc": "A smart home system which one other person and I created for IT competitions.",
        "tools": "Python, PHP, Arduino, Raspberry Pi, TI Launchpad."
      }
    },
    "skil": {
      "front-end": {
        "js": "Certificate from ''SoftUni''",
        "vue": "Project that uses Vue.js",
        "react": "Project that uses React"
      },
      "private": "Private Repository, because of the university policy. Please contact me for more info.",
      "server": {
        "thy": "Project that uses Thymeleaf"
      },
      "back-end": {
        "redux": "Project that uses Redux for back-end",
        "spring": "Project that uses Spring Boot for back-end",
        "js": "Certificate for JavaScript applications from ''SoftUni''"
      },
      "gen": {
        "java": "Voluteer work for ''TOM Bulgaria''",
        "ch": "A project I created for IT competitions in Bulgaria",
        "has": "Course from university"
      },
      "db": {
        "mssql": "Course from ''SoftUni''",
        "firebase": "Project that uses Firebase for a database",
        "jpa": "Project that uses JPA as storage"
      },
      "tools": {
        "git": "I'm using git for all of my projects.",
        "latex": "I'm using LaTeX for mathematical formulas and scientific articles. I have also a certificate from a university course on this subject.",
        "r": "University course with a certificate",
        "dig-mar": "Certificate from Google",
        "agile": "Certificate from university",
        "mario": "Project that we did in Robotics summer camp. I have created multiple projects with Arduino and Raspberry Pi and I obtained certificate from SoftUni."
      }
    }
  },
  "cont": {
    "title": "Contact",
    "text": {
      "I-am": "I am currently looking for ",
      "freelance": "freelance",
      "work": " work and/or interesting ",
      "job": "job opportunities",
      "email": ", so be sure to send me an email."
    },
    "get-in-touch": "Get in touch",
    "coffee": "Buy me a coffee"
  }
}